results/1gpu-8b-tp1/ec2-direct/2026-05-07T15:17:31Z/vllm_serving/rate_2/run_0.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x705ad7943880>, seed=42, num_prompts=50, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/bench/results/ec2-direct/2026-05-07T15:17:31Z/vllm_serving/rate_2', result_filename='run_0.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-e8691be4-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 05-07 15:21:02 [datasets.py:611] Sampling input_len from [512, 512] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 50/50 [00:34<00:00,  1.46it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  34.28     
Total input tokens:                      25600     
Total generated tokens:                  6400      
Request throughput (req/s):              1.46      
Output token throughput (tok/s):         186.71    
Peak output token throughput (tok/s):    295.00    
Peak concurrent requests:                28.00     
Total token throughput (tok/s):          933.56    
---------------Time to First Token----------------
Mean TTFT (ms):                          266.14    
Median TTFT (ms):                        243.78    
P99 TTFT (ms):                           552.69    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          80.65     
Median TPOT (ms):                        81.80     
P99 TPOT (ms):                           84.58     
---------------Inter-token Latency----------------
Mean ITL (ms):                           80.65     
Median ITL (ms):                         80.24     
P99 ITL (ms):                            181.68    
==================================================